# IN CLASS LAB EXERCISE - 02

(Kaggle Automobile Dataset)

 We will be using the [automobiles Dataset](https://www.kaggle.com/nisargpatel/automobiles/data) from Kaggle. 

**INCLASS LAB EXERCISE** answer below question. Load pandas as pd and upload the Automobile.csv file as auto


1. symboling: -3, -2, -1, 0, 1, 2, 3. 
2. normalized-losses: continuous from 65 to 256. 
3. make: 
alfa-romero, audi, bmw, chevrolet, dodge, honda, 
isuzu, jaguar, mazda, mercedes-benz, mercury, 
mitsubishi, nissan, peugot, plymouth, porsche, 
renault, saab, subaru, toyota, volkswagen, volvo 

4. fuel-type: diesel, gas. 
5. aspiration: std, turbo. 
6. num-of-doors: four, two. 
7. body-style: hardtop, wagon, sedan, hatchback, convertible. 
8. drive-wheels: 4wd, fwd, rwd. 
9. engine-location: front, rear. 
10. wheel-base: continuous from 86.6 120.9. 
11. length: continuous from 141.1 to 208.1. 
12. width: continuous from 60.3 to 72.3. 
13. height: continuous from 47.8 to 59.8. 
14. curb-weight: continuous from 1488 to 4066. 
15. engine-type: dohc, dohcv, l, ohc, ohcf, ohcv, rotor. 
16. num-of-cylinders: eight, five, four, six, three, twelve, two. 
17. engine-size: continuous from 61 to 326. 
18. fuel-system: 1bbl, 2bbl, 4bbl, idi, mfi, mpfi, spdi, spfi. 
19. bore: continuous from 2.54 to 3.94. 
20. stroke: continuous from 2.07 to 4.17. 
21. compression-ratio: continuous from 7 to 23. 
22. horsepower: continuous from 48 to 288. 
23. peak-rpm: continuous from 4150 to 6600. 
24. city-mpg: continuous from 13 to 49. 
25. highway-mpg: continuous from 16 to 54. 
26. price: continuous from 5118 to 45400.

--------

In [2]:
import pandas as pd

**Q.no(1). Check the head of the DataFrame.**

In [4]:
amob=pd.read_csv('Automobile.csv')
amob.head()

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,168,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.0,115,5500,18,22,17450

------------------

**Q.no(2). How many rows and columns are there.**

In [8]:
amob.shape

(201, 26)

---------------------

**Q.no(3). What is the average Price of all cars in the dataset.**

In [12]:
amob['price'].mean()

13207.129353233831

-------------------------------

**Q.no(4). Which is the cheapest make and costliest make of car in the lot.**

In [70]:
min_price=amob['price'].min()
max_price=amob['price'].max()
chep_mak=amob[amob['price']==min_price]
cost_mak=amob[amob['price']==max_price]
print(chep_mak['make'])
print(cost_mak['make'])

134    subaru
Name: make, dtype: object
71    mercedes-benz
Name: make, dtype: object

--------------------

**Q.no(5). How many cars have horsepower greater than 100.**

In [71]:
hp_car=amob[amob['horsepower']>100]
hp_car.shape[0]

90

----------------

**Q.no(6). How many hatchback cars are in the dataset .**

In [72]:
hatch_car=amob[amob['body_style']=='hatchback']
hatch_car.shape[0]

68

-------------------

**Q.no(7). What are the 3 most commonly found cars in the dataset?**

In [21]:
amob['make'].value_counts().head(3)

toyota    32
nissan    18
mazda     17
Name: make, dtype: int64

-----

**Q.no(8). Someone purchased a car for 7099, what is the make of the car?**

In [23]:
cars=amob[amob['price']==7099]
cars['make']

87    nissan
Name: make, dtype: object

-------------

**Q.no(9). Which cars are priced greater than 40000.**

In [24]:
cars=amob[amob['price']>40000]
cars['make']

15              bmw
70    mercedes-benz
71    mercedes-benz
Name: make, dtype: object

---

**Q.no(10). Which are the cars that are both a sedan and priced less than 7000?**

In [25]:
cars=amob[(amob['price']<7000) &
         (amob['body_style']=='sedan')]
cars['make']

19      chevrolet
24          dodge
42          isuzu
50          mazda
82     mitsubishi
86         nissan
88         nissan
89         nissan
118      plymouth
152        toyota
Name: make, dtype: object

---------------

**Q.no(11) Show the prices of cars in ascending order.**

In [26]:
amob['price'].sort_values()

134     5118
17      5151
47      5195
146     5348
73      5389
       ...
16     36880
125    37028
70     40960
15     41315
71     45400
Name: price, Length: 201, dtype: int64

--------

**Q.no(12).Show the prices of the cars in descending order.**

In [27]:
amob['price'].sort_values(ascending=False)

71     45400
15     41315
70     40960
125    37028
16     36880
       ...
73      5389
146     5348
47      5195
17      5151
134     5118
Name: price, Length: 201, dtype: int64

----------------

**Q.no(12).What is the rank order of the cars as per there horsepower.**

In [33]:
amob['h_pw_rank']=amob['horsepower'].rank(ascending=False)
amob[['make','h_pw_rank']]

            make  h_pw_rank
0    alfa-romero       68.5
1    alfa-romero       68.5
2    alfa-romero       27.0
3           audi       82.0
4           audi       58.0
..           ...        ...
196        volvo       61.5
197        volvo       20.0
198        volvo       40.0
199        volvo       79.0
200        volvo       61.5

[201 rows x 2 columns]

---------------------

**Q.no(13).What is the rank order of the cars as per there minimum prices.**

In [73]:
amob['price_rank']=amob['price'].rank(ascending=True,method='min') # asecnding =True 
amob[['price','price_rank']].sort_values('price_rank')

     price  price_rank
134   5118         1.0
17    5151         2.0
47    5195         3.0
146   5348         4.0
73    5389         5.0
..     ...         ...
16   36880       197.0
125  37028       198.0
70   40960       199.0
15   41315       200.0
71   45400       201.0

[201 rows x 2 columns]

------

**Q.no(14).What is the rank order of the cars as per there maximum prices.**

In [67]:
amob['price_rank']=amob['price'].rank(ascending=False,method='max')
amob[['price','price_rank']]

     price  price_rank
0    13495        72.0
1    16500        52.0
2    16500        52.0
3    13950        66.0
4    17450        40.0
..     ...         ...
196  16845        45.0
197  19045        27.0
198  21485        23.0
199  22470        21.0
200  22625        20.0

[201 rows x 2 columns]

-------------

**Q.no(15).What is the dense rank order of the cars as per there horsepower.**

In [41]:
amob['h_pw']=amob['horsepower'].rank(ascending=False,method='dense')
amob[['make','h_pw']]

            make  h_pw
0    alfa-romero  28.0
1    alfa-romero  28.0
2    alfa-romero  13.0
3           audi  31.0
4           audi  25.0
..           ...   ...
196        volvo  26.0
197        volvo  10.0
198        volvo  20.0
199        volvo  30.0
200        volvo  26.0

[201 rows x 2 columns]

--------------

**Q.no(16). Write a code to display the  `make` and `price` of `5,6,10` rows.**

In [61]:
cars=amob[['make','price']]
cars.iloc[[5,6,10]]

    make  price
5   audi  15250
6   audi  17710
10   bmw  16925

------

**Q.no(17). Write a code to display the  `first five columns` and  `5 to 10 rows` using as per `index position`.**

In [75]:
cars=amob.iloc[5:11,0:5]
cars

    symboling  normalized_losses  make fuel_type aspiration
5           2                161  audi       gas        std
6           1                158  audi       gas        std
7           1                168  audi       gas        std
8           1                158  audi       gas      turbo
9           2                192   bmw       gas        std
10          0                192   bmw       gas        std

------------------------------------

# ----------------------------------HAPPY LEARNING----------------------------------------

-------